//1 კომენტარის სახით ახსენით რაში გამოიყნება addEventListener'ი  იგი გამოიყენება რაღაც მოვლენის შესასრულებლად და ეწოდება მოვნელის მსმენელი მაგალითად ღილაკზე დაკლიკვისას ღილაკი გახდეს წითელი


//2 JS'ში შექმენით ცვლადი სადაც შეინახავთ თქვენთვის სასურველ რიცხვს 10'ის ფარგლებში ასევე შექმენით ერთი ცვლადი სადაც მომხმარებელს შემოატანინებთ რიცხვს შემდეგ HTML'ში შექმენით ერთი button რომელსაც წამოიღებთ JS'ში და დაადებთ მოვლენის მსმენელს ღილაკზე დაკლიკების დროს თუ მომხმარებლის რიცხვი დაემთხვევა თქვენს რიცხვს ალერტით გამოიტანეთ "შენ გამოიცანი ჩემი რიცხვი" თუ არა მაშინ "შენ ვერ გამოიცანი ჩემი რიცხვი"
    let myNumber = 7;

 
    let button = document.getElementById("checkButton");
    let input = document.getElementById("userNumber");

   
    button.addEventListener("click", function() {
      let userNumber = Number(input.value); 
      
      if (userNumber === myNumber) {
        alert("შენ გამოიცანი ჩემი რიცხვი");
      } else {
        alert("შენ ვერ გამოიცანი ჩემი რიცხვი");
      }
    });

//3 შექმენით სარეგისტრაცი ფორმა სადაც გექნებათ ემაილი, პაროლი, სახელი და submit ინფუთი შემდეგ როდესაც მომხმარებელი დააჭერს submit ღილაკს კონსოლში გამოიტანეთ "შენ წარმატებით გაიარე რეგისტრაცია და ასევე მისი მონაცემები რომელიც რეგისტრაციის დროს გამოიყენა"
let bt=document.getElementById("ft")
bt.addEventListener("click",function(e){
    e.preventDefault()
    console.log("წარმატებით გაიარე რეგისტრაცია")

})

