#1 დაწერეთ პროგრამა სადაც შეამოწმებთ იყოფა თუ არა რიცხვი 10-ზე თუ იყოფა დაპრინთეთ "იყოფა" თუ არ იყოფა დაპრინტეთ "არ იყოფა"
namber=int(input("enter namber: "))
if namber//10:
    print(" იყოფა")
else:
    print("არ იყოფა")

#2 დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს პაროლი. პროგრამა კვლავ მოუწოდებს მოსთხვოს პაროლის შეყვანას, სანამ არ გამოიცნობს სწორ პაროლს.
pasword="secret"
secret=input("enter youre pasword: ")

while secret != pasword:
    print("არასწორი პაროლი შეიყავანე")
    secret=input("enter youre pasword: ")
print("სწორი პაროლი შეიყვანე")

#3 შემოატანინეთ მომხმარებელს მისი ასაკი თუ მისი ასაკი 18 წელზე მეტია დაუპრინტეთ “you are adult” თუ 18 წელზე ნაკლები “you are virgin”
age=int(input("enter age: "))
if age<18:
    print("you are virgin")
else:
    print("you are adult")

#4 დაწერე პროგრამა სადაც for ციკლის დახმარებით გამოიტანთ რიცხვებს 1-დან 50-მდე და შემდგომ if,else დახმარებით გამოიტანეთ ლუწები
for i in  range(1,51):
    if i % 2==0:
        print(i)

#5 დაწერე პროგრამა სადაც for ციკლის დახმარებით გამოიტანთ რიცხვებს 1-დან 50-მდე და შემდგომ if,else დახმარებით გამოიტანეთ კენტები
for i in  range(1,51):
    if i % 2!=0:
        print(i)