
#1 typy გავიგებთ თუ ინტეჯერია სტრინგი თუ ფლოათი 


#2 სტრინგის გაადაქცევა ინტეჯერად 
string= "15"
print(int(string))

#3 შემოიტანეთ 2 ინოუთი 1 ინტეჯერი 2სტრიგი თქვენი დავალებაა ორივე გახადოთ ინტეჯერი და მიუმატოთ ერთმანეთს 
integer= 35
string= "45"
print(int(string + string))

#4 შემოიტანეთ ყველანაირი ტიპის ცვლადები type ის დახმარებით 
integer= 14
string= "14"
float= 14.0
print(type(integer),type(string),type(float))

#5 შემოიტანეთ 3 ცვალიდ და სამივე იწნება ფლოათი თქვენი დავალებაა ფლოათი აქციოთ სრტინგად
float=14.0
float1=15.0
float2=16.0
print(int(float),int(float1),int(float2))



#6 შემოიტანეთ ცლადი name age and height დაპრინტეთ მისი type ბი
name="სანდრო"
age=14
height=1.63
print(type(name),type(age),type(height))


#7 შექმენით ინტეჯერის ტიპის ცვლადი მიანიჭეთ მას რიცხვი , რომელიჩ წამოიქმნება ორი სხვადასხვა ინტეჟერების გამრავლებით შეამოწმეთ არის თუ არა მნიშვნელოდა დადებითი ხოლო დაპრინთეთ შედეგი

a =  1000 
b = 3 
print(a * b) #დადებითიი

#8 შექმენით float გაამავლეთ იგი გაამრავლეთ სრინგულ 3 ზე თვენი დავალებაა ეს სტრინგული სამი აქციოთ ინტეშეჯერათ და მერე გაამრავლოთ float ზე

float= 14.0
string=(int('3'))
print(float*string)


#9  ახსენით კომენტარებით რა არის sting float და integer

# string არის ნებისმიერი სიტყვა ან რიცხვი ბრჭყალებში

# float არის ათწილადი რიცხვი
# integer არის მთელი რიცხვი











