// შექმენით ორი სია, პრიველში დაამატეთ 10 ცალი ცაიფრი მეორეში 10 ცალი სტრინგი, შემდეგ ეს ორი სია გაერთიანეთ ერთ სიაში მეთოდის საშუალებით, შემდეგ delete ით შეცვალეთ მეხუთე ინდექსზე მდგომი ელემენტი undefined ით,  შემდეგ სიიდან ამოაგდეთ ბოლო ელემენტი, შემდეგ ამოაგდეთ პირველი ელემენტი და პირველ ინდექსზე ჩასვით "ვანო",  შემდგომბოლოშ ჩაამატეთ ერთი ელემენტი "მოთიაშვილი", საბოლოოდ გამოიტანეთ ეს მთლიანი სია გადაქცეული სტრინგად (დაიხმარეთ რესურსები)
let nums=[1,2,3,4,5,6,7,8,9,10]
let num=[11,12,13,14,15,16,17,18,19,20]
console.log(nums.concat(num))
let number=nums+num;
console.log(number)
let num1 =delete number[5]
console.log(num1)
console.log(num.pop())
console.log(nums.shift())
