    //1 ახსენით რა არის DOM'ი. დომი არის ჰთმლს დოკუმენტი და მაგას ეძახიან ხეს იმიტომ რომ ძალიან გავს

    //2 ჩამოწერეთ ყველა მათემატიკური ოპერაციები და ახსენით რას აკეთებენ ისინი. + უმატებს,-აკლებს,% ყოფს ნაშთით,++რიცხვს ემატება ერთი,--რიცხვს აკლება ერთი

    //3 შეასრულეთ მინიმუმ 3-3 მაგალითი თითოეულ მათემატიკურ ოპერაციაზე და გამოიტანეთ კონსოლში
    // მიმატება 
    console.log(5+5)
    console.log(7+6)
    console.log(12+9)

    // გამოკლება
    console.log(23-15)
    console.log(60-30)
    console.log(90-32)

    // ++
    console.log(++13)
    console.log(++85)
    console.log(++123)

    // 4 HTML'ში შექმენით პარაგრაფი სადაც ჩაწერთ თქვენთვის სასურველ ტექსტს, შემდეგ ეს ტქესტი გადმოიტანეთ JavaScript'ში და შეინახეთ ცვლადშ ბოლოს კი გამოიტანეთ ეს ცვლადი 
    let sandro= document.getElementById("sa").textContent;
    alert(sa)

    //5 შექმენით ცვლადი რომელსაც გაუტოლებთ 5 ეს ცვლადი ჯერ გამოიტანეთ შემდეგ კი გაზარდეთ ერთით, ამის შემდეგ კიდევ გამოიტანეთ ეს ცვლადი ოღონდ ჯერ გაზარდეთ და შემდეგ დაბეჭდეთ
    let sand =5;
    console.log(send++)
    console.log(++send)
