#1 შექმენი ლისტი რომელშიც შეინახავ 20 ელემენტს და შემდეგ დაპრინტე ის
namber=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(namber)

#2 შექმენი ლისტი რომელში შეინახავ 5 ელემენტს და შემდგომ დაუმატე სხვა ლისტს რომელშიც შეინახავ 10 ელემენტს
namber1=[1,2,3,4,5,]
name=["sandro","gurami","sandro1","toma","saba"]
print(namber1+name)

#3 შექმენი ლისტი რომელშიც შეინახავ 4 სიტყვას და შემდგომ indexing-ის დახმარებით გამოიტანე 0 ინდექსი და 3 ინდექსი
         #0 #1 #2 #3
namber2=[1, 2, 3, 4 ]
print(namber2[0])
print(namber2[3])
