//1  მომხმარებელს შემოატანინეთ რიცხვი და უთხარით ლუწია თუ კენტი. 
let num=prompt("enet youre number");
    if(num%2===0){
        console.log("ლუწია")
    }else{
        console.log("კენტია")
    }

//2 მაღაზიაში არის ფასდაკლება მხოლოდ არასრულწოვნებზე. არასრუწლოვანი ადამიანი მიიღებს 50%იან ფასდაკლებას ხოლო სრულწლოვანი გადაიხდის ჩვეულებრივ ფასს. მომხმარებელს შემოატანინე მისი წლოვანება და დაწერეთ პროგრამა რომელიც ადამიანს ეტყვის მან მიიღო თუ არა ფასდაკლება.
const age=prompt("enter youre age");
    if(age!=18){
        console.log("შენ მიიღე ფასდაკლება")
    }else{
        console.log("შენ არ ხარ სრულწლოვანი და ვერ მიიღე ფასდაკლება")
    }

//3 მაღაზიაში არის ფასდაკლება მხოლოდ არასრულწოვნებზე და 18 წლის ხალხზე. არასრუწლოვანი ადამიანი მიიღებს 50%იან ფასდაკლებას, 18 წლის ადამიანი მიიღებს 25% ფასდაკლებას, ხოლო სრულწლოვანი გადაიხდის ჩვეულებრივ ფასს. მომხმარებელს შემოატანინეთ მისი ასაკი და დაწერეთ პროგრამა რომელიც ადამიანს ეტყვის მან მიიღო თუ არა ფასდაკლება და თუ მიიღო რამდენი.
let age1=prompt("entet youre age");
    if(age1<18){
        console.log("შენ მიიღე 50% იანი ფასდაკლება")
    }else if(age1===18){
        console.log("შენ მიიღე 25% იანი ფასდაკლება")
    }else{
        console.log("შენ გადაიხდი იგივე ფასს")
    }

//4  კომენტარის სახით ახსენით რა შემთხვევაში აქვს ცვლადს false/true მნიშვნელობა პასუხ დაწერეთ ვრცლად






//5 მომხმარებელს შემოატანინეთ სახელი თუ მისი სახელის სიგრძე აღემატება 6 მაშინ დაბეჭდეთ "hello my friend 'name!' სხვა შემთხვევაში "hello 'name'!"
let name = prompt("შეიყვანე შენი სახელი:");

if (name.lenght > 6) {
  console.log(`hello my friend '${name}!'`);
} else {
  console.log(`hello '${name}!'`);
}
