//1 ივარჯიშეთ for in და for of ზე და გააკეთეთ თითოეულზე 5 მაგალითი
let obj={
    name:"sandro",
    username:"jojua",
    age:15
}
for(let i in obj){
    console.log(i)
}


let numbers=[1,2,3,4,5,6,7];
for(let i in numbers){
    console.log(i)
}

//2 კომენტარის სახით ახსენით თქვენთვის ნასწავლი ყველა მეთოდი 
// .upper() სტრინგში ადიდებს ყველა ასოს
// .lower() სტრინგში აპატარავებს ყველა ასოს
// .capitalaze() ადიდებს მხოლოდ პირველ ასოს
// .split(" ") სტრინგს ხლიჩავს არგუმენტში გადაცემულ ელემენტს და აბრუნებს სიის სახით
// .replace("1","2") იგი ანაცვლებს პირველ არგუმენტში გადაცემულ ელემენტს მეორეთი ანუ სადაც შეხვდება 1ი გადააქცევს 2ად
// "".join() აჯოინებს სტრინგს

//3 კომენტარის სახით ახსენით რაში გვჭირდება რესპონსივი საიტზე
// რესპონსივი ეხმარება ყველა მობილურის პლანშეტის თუ კომპიუტერს დაინახოს კარგად საიტი მაგალითად კომპიუტერი დიდია ინჩი აქვს მობილურს პატარა ზუსტად ისე უნდა გააკეთო რომ ყველგან ჩანდეს კარგად