//1 შექმენით სია სადაც შეინახავთ ელემენტებს და ასევე ერთი ცვლადი რომელსაც გაუტოლებთ ცარიელ სტრინგს შემდეგ for in ის საშუალებით გადაუარეთ ამ სიის ინდექსებს და ცარიელ ცვლადში დაამატეთ მხოლოდ ლუწ ინდექსზე მდგომი ელემენტები.
let numbers = [1, 2, 3, 4, 5, 6, 7, 8];
let str = "";

for (let index in numbers) {
  if (index % 2 === 0) { 
    str += numbers[index];
  }
}
console.log(str);

//2 შექმენით სია რომელსაც გადაუვლით for of ის მეშვეობით და გამოიტანეთ თოთოეული ელემენტი
let num=["sandro","saba","luka"];
for(let i of num){
    console.log(i)
}