# 1 )შექმენით while loop რომელიც გამოიტანს "hello world!" სანამ არ გაუტოლდება 20'ს
namber = 0
while namber < 20:
    print("hello world!")
    namber += 1

# 2 მომხმარებელს შემოატანინეთ სია და for loop ის საშუალებით გამოიტანეთ ყველა ელემენტი
namber1=[1,2,3,4,5,6,7,8]
for i in namber1:
    print(i)


# 3 დაწერეთ მსგავსებები და განსხვავებები set, dictionary, tuple ზე
# set -ს ინდექსინგი არ გააჩნია და დუბლიკატებს შლის. დიქტს იგევა რაც ბიბლიოთება მას აქვს გასაღებები და მნიშვნელობები. თაფლი შეიცვლელია ანუ არ შეგვიძლია რამე ჩავამტოთ.


# 4 რას ნიშნავს immutable, mutable. muteble ნიშნავს ცვალებადი და immutable ნიშნავს უცვლელს



# 5 რას ეწოდება კონკატენაცია. კონკატინაცია ნიშნავს ორი სტრინგის შეერთებას


# 6 and და or ოპერატორებზე გააკეთეთ 5-5 მაგალითი 
print(10>7 or 10<7)
print(13>=7 or 18!=3)
print(3>=7 or 34>13)
print(100==100 or 130<7)
print(3000>100 or 100<7)

print(34!=34 and 34==34)
print(54==34 and 56>34)
print(50!=34 and 120<=120)
print(120==34 and 54<=54)
print(124!=64 and 34==54)

