// 1 ჩამოწერეთ დღეს ნასწავლი ყველა მეთოდი, კომენტარის სახით განმარტეთ და გააკეთეთ 2 მაგალითი თითოეულზე.
// .Trunc წერტილის შემდეგ ყველაფერს შლის 3.1343 გამოიტანს 3ს
// .pow(2,3) გადაეცემა ჯერ რიცხვი და შემდეგ ხარისხი ამის შედეგი იქნება (8)
// .round(2,5) მეთოდი რომელიც ამრგავლებს რიცხვს შედეგი(3)
// . ceil(2,05) მეთოდი ამრგვალებს რიცხვს ზევით (ყველაზე ახლო მთელ რიცხვზე) შედეგი იქნება (2)

console.log(Math.trunc(2.124))  // შედეგი (2)
console.log(Math.trunc(3.343))  // შედეგი (3)


console.log(Math.pow(3,5)) // შედეგი(243)
console.log(Math.pow(4,3)) // შედეგი (64)

console.log(Math.round(4,5)) // შედეგი(5)
console.log(Math.round(4,2)) // შედეგი(4)

console.log(Math.ceil(2,4)) // შედეგი(3)
console.log(Math.ceil(1,4)) // შედეგი(2)


//2 დაბეჭდეთ 100'ის ფარგლებში რენდომული რიცხვი.
console.log(Math.random() * 100)


//3 შექმენით ცვლადი სადაც შეიახავთ 5'ის ფარგლებში რენდომ რიცხვს,ეს რიცხვი დაამრგვალეთ "ზემოთ" და შემდეგ გამოიტანეთ ამ რიცხვის კვადრატი.
let x=Math.random() * 5;
console.log(x)
x =  Math.ceil(x)
console.log(Math.pow(x,2))

//4 შექმენით person ობიექტი, მასში შეინახეთ სახელი, გვარი და ასაკი რომელსაც აარჩევთ math.random()'ის მეშვეობით 20'ის ფარგლებში. აუცილებლად შეინახეთ მთელი რიცხვი შემდეგ კი დაბეჭდეთ ობიექტი.
let my={
    name:"sandro",
    username:"jojua",
    age:"15"
}
console.log(my)

console.log(Math.random() * 20)

