//1  შექმენით ფუნქცია რომელსაც გადასცემთ მხოლოდ ერთ არგუმენტს number'ს და ასევე შექმენით ერთი ცვლადი i რომელსაც გაიტოლებთ 0'ს შემდეგ while loop ის საშუალებით მიესალმეთ მომხმარებელს იქამდე სანამ i არ გაუტოლდება მომხმარებლის შემოტანილ რიცხვს
function sandro(number) {
  let i = 0;
  while (i < number) {
    console.log("hello");
    i++;
  }
}
sandro(5);

//2შექმენით ფუნქცია სადაც მომხმარებელი შემოიტანს ასაკს თუ ასაკი არ აღემატება 19 მაშინ გამოუტანეთ "თქვენ მიიღეთ 30% ფასდაკლება" თუ ასაკი მეტია ან ტოლი 19 და ნაკლები 50 გამოუტანეთ "თქვენ მიიღეთ 10% ფასდაკლება" და თუ ასაკი აღემატება 50 მაშნ გამოუტანეთ "თქვენ მიიღეთ 50% ფასდაკლება"
function sandro1(age){
    
    if(age >19){
        console.log("თქვენ მიიღეთ 30% იანი ფასდაკლება")
    }else if(age >=19 && age<50){
        console.log("თქვენ მიიღეთ 10% იანი ფასდაკლება")
    }else{
        console.log("თქვენ მიიღეთ 50% იანი ფასდაკლება")
    }
}
sandro1(15)