# # 1 შექმენით dictionary სადაც შეინახავთ მინიმუმ 3 key'ს და ასევე შექმენით 2 ცარიელი სია for loop'ის დახმარებით პირველ სიაში დაამატეთ key ხოლო მეორე სიაში კი value ბოლოს კი გამოიტანეთ ერთად. 
# list1=[]
# list2=[]
# dict={
# "name":"sandro",
# "sports":"basketball",
# "food":"xinkali"
# }
# for i in dict:
#     if i==dict.keys():
#         print(dict.append(list1))

# 2 მოცემული გაქვთ რაიმე result ცვლადი რომელშიც შეყვანილია სია [10,43,12,11,94,10,55,7,11] თქვენი დავალებაა გააქროთ ყველა დუბლიკატი ლისტიდან „თანმიმდევრობას მნიშვნელობა არაქვს“.
# result=[10,43,12,11,94,10,55,7,11]
# result.remove(10)
# result.remove(11)
# print(result)

#3 შექმენით ცარიელი dictionary შემდეგ მომხმარებელს შემოატანინეთ ჯერ key  შემდეგ კი value ამის შემდეგ თხოვეთ შეცვალოს ძველი value  და შემოატანინეთ ახალი მნიშვნელობა შემდეგ კი გამოიტანეთ საბოლოო dictionary.
dict={
"name":"sandro",
"sports":"basketball",
"food":"xinkali"
}
name=input(dict.keys("enter"))
print(name)

#4  შექმენით სეტის მსგავსი ფუნქცია რომელიც მიიღებს ლისტს და ლისტიდან წაშლის დუბლიკატებს „ფუნქციაში არ გამოიყენოთ სეტი“
