//1 შექმენით ცვლადი სადაც შეინახავთ თქვენთვის სასურველ ასაკს, თუ იქნება 13 წელზე ნაკლების გამოუტანეთ You are kid, თუ იქნება 18 წელზე ნაკლების მაგრამ 13'ზე მეტის გამოუტანეთ You are not adult yet და თუ იქნება 18 წელზე მეტის გამოუტანეთ You are adult

let age = 15; 

if (age < 13) {
    console.log("You are kid");
} else if (age < 18) {
    console.log("You are not adult yet");
} else {
    console.log("You are adult");
}


//2 შექმენით ცვლადი სადაც შეიტანთ რაიმე რიცხვს, თუ რიცხვი იყოფა 2'ზე უნაშთოდ გამოიტანეთ ეს რიცხვი, სხვა შემთხვევაში დააბრუნეთ "ეს რიცხვი კენტია"
let number=8;
    if(number %2===0){
        console.log(number)
    }else{
        console.log("ეს რიცხვი კენტია")
    }


//3 პითონის ფაილში წერია


//4 რას აკეთებს "!" ოპერატორი ახსენით თქვენი სიტყვებით: ეს იგივეა რაც პითონში not ოპერატორი consol.log(!(10>7)) აქ სინამდვილეში ეს ბულეანი არის true მაგრამ გამოიტანს false იმიტომ რომ ! ეს ოპერატორი საპირისპიროდ აბრუნებს


//5 შექმენით ცვლადი სადაც შეინახავთ რაღაც რიცხვს შემდეგ შეამოწმეთ თუ ეს რიცხვი იყობა 3'ზეც და 9'ზეც გამოიტანეთ ეს რიცხვი, სხვა შემთხვევაში დააბრუნეთ "task was not completed."
let num=18;
    if(num %3==0 && num%9==0){
        console.log(num)
    }else{
        console.log("task was not completed.")
    }


