#1 შექმენით სია სადაც ჩაამატებთ თქვენ საყვარელ 6 საჭმელსა.
# ინდექსირების გამოყენებით დაბეჭდეთ სიიდან პირველი, მეოთხე და ბოლო ელემენტი.
foot=["shaurma","mwadi","cezari","kartopili","qatami","lobiani"]
print(foot[0])
print(foot[3])
print(foot[5])

#2 შექმენით სია სადაც ჩაამატებ შვიდ ფერს.
# სლაისინგის გამოყენებით დაბეჭდეთ პირველი სამი ფერი და ბოლო ორი ფერი სიიდან.
colors=["blue","red","grean","pink","purple","black","white"]
print(colors[0:3])
print(colors[5:7])

#3.დაწერეთ სტრინგი, რომელიც აღწერს თქვენს საყვარელ ჰობის (მაგ., "მე მიყვარს პროგრამირება").
# სლაისინგის გამოყენებით დაბეჭდეთ ამ წინადადებიდან მხოლოდ თქვენი ჰობის სახელი.
hoby="მე მიყვარს კალათბურთი"
print(hoby[10:22])


#4 შექმენით სია იმ ხუთი ქალაქის, რომელთა მონახულებაც გსურთ.
# შეცვალეთ მესამე ქალაქი სხვა ქალაქით ინდექსირების გამოყენებით.
# დაბეჭდეთ განახლებული სია.
canrty=["საქართველო","გერმანია","უკრაინა","პარიზი","შვედეთი"]
canrty[2]="იაპონია"
print(canrty)

#5 დაწერეთ წინადადება თქვენს საყვარელ ცხოველზე (მაგ., "დელფინი ჩემი საყვარელი ცხოველია").
# სლაისინგის გამოყენებით დაბეჭდეთ წინადადების მხოლოდ პირველი და ბოლო სიტყვა(უარყოფიდი რიცხვის გამოყენებით).
pets="კატა ჩემი საყვარელი ცხოველია"
print(pets[-28])
print(pets[-1])