#1  შექმენით დიქშენერი რომელშიც შეინახავთ თქვენი საყვარელი მანქანის აღწერას ბრენდის სახელს, მოდელსა და გამოშვების წელს შემდეგ დიქშენერიდან გამოიტანეთ გასაღებები და მნიშვნელობები წყვილად შემდეგ კი ცალ-ცალკე 
# dict1={
#     "car": "bmw",
#     "model": "e60",
#     "years": "2008"
# }
# print(dict1)
# print(dict1.keys())
# print(dict1.values())

#2 შექმენით 2 სეტი და ჯერ შეაერთეთ ერთმანეს შემდეგ გამოიტანეთ გნსხვავებები და მსგავსებები მათ შორის
name={"sandro","saba","nika","vano"}
name1={"sandro","luka","vano","mari"}
print(name | name1)
print(name.difference(name1))
print(name.intersection(name1))


#3 შექმენით დიქშენერი რომლის მნიშვნელობებსაც გადაატარებთ forloop'ს და გამოიტანეთ ისინი ისინი
dict2={
    "name":"sandro",
    "name1":"vano",
     "name2":"luka"
}
for key,value in dict2.items():
    print(f"{key}:{value}")


#4 ახსენით დიქშენერი და სეტები კომენტარის სახით
# სეტეებს ინდექსინგი არ გააჩნია და დუპლიკატებს შლის ანუ რაც ორჯერ მეორდება ხოლო, დიქშენერი არის ბიბლიოთეკა და მანდ არის გასაღები მნიშვნელობა და აითები მაგალითად "name":"sandro" აქ ნეიმი არის გასაღები ხოლო სანდრო მნიშვნელობა