//1 კომენტარების სახით ახსენით თითოეული დღეს ნასწავლი მეთოდი, ყველაფერი დევს რესურსებში
let list11=[1,2,3,4,5,6,7,8,9];
let list111=[2,3,4,5,67,];
// console.log(list.toString()) გადააქცევს სიის თითიეულ ელემენტს ერთ სტრინგად

// console.log(list.at(2)) სიაში არგუმენტად გადაცემულ მდგომ ელემენტს გამოიტანს

// console.log(list.join("&")) გადააქცევს სიას სტრინგად და რასსც გადავცემთ იმით შეაერთებს ყველა ელემნტს

// console.log(list.push("sandro")) იგივეა რაც პითონის append

// console.log(list.pop()) ამოაგდებს სიიდან ბოლო ელემენტს

// console.log(list.shift()) ამოაგდებს სიიდან პირველ ელემენტს

// console.log(list.unshift(2)) სიაში ჩაამატებს მენულე ინდექსზე გადაცემულ არგუმენტს

// delete list(3) მოცემულ ინდექსზე წაშლის ელემენტს და მის მაგივრად გამოიტანს empty  და ეს არ არის მეთოდი ეს არ ქივორდი


// console.log(list.slice(2,5)) იგივეა რაც პითონის სლაისინგი


//2 შექმენით ორი სია, პრიველში დაამატეთ 10 ცალი ცაიფრი მეორეში 10 ცალი სტრინგი, შემდეგ ეს ორი სია გაერთიანეთ ერთ სიაში მეთოდის საშუალებით, შემდეგ delete ით შეცვალეთ მეხუთე ინდექსზე მდგომი ელემენტი undefined ით,  შემდეგ სიიდან ამოაგდეთ ბოლო ელემენტი, შემდეგ ამოაგდეთ პირველი ელემენტი და პირველ ინდექსზე ჩასვით "ვანო",  შემდგომბოლოშ ჩაამატეთ ერთი ელემენტი "მოთიაშვილი", საბოლოოდ გამოიტანეთ ეს მთლიანი სია გადაქცეული სტრინგად
let number=[1,2,3,4,5,6,7,8,9.10];
let str=["a","b","g","d","e","v","z","t","i","k"]
num1=number.concat(str)
console.log(num1)
delete num1[5]
console.log(num1)
console.log(num1.pop())
console.log(num1.shift())
console.log(num1.push("motiahvili"))
console.log(num1.toString())

//3 შექმენით 3 სია, პირველს შეაურთედ მეორე და შეინახეთ ცვალდშ, შემდეგ ეგ სია შეურთედ მესამეს და ისიც შეინახეთ ცვლადიშ, შემდგომ splice ის საშუალების მე 2 ინდექსიდან ემ 5 ინდექსამდე წაშალეთ ელემენტები და მესამე ელემენტო გახადეთ undefined, delete ის საშუალებით, შემდგომ გამოიტანეთ ამ სიის ბოლო ელემენტი

let num1 = [1, 2, 3];
let num2 = [4, 5, 6];
let num3 = [7, 8, 9];

let number1 = num1.concat(num2);
let num = num1.concat(num3);

num.splice(2, 4);
delete num[2];   
console.log(num);           
console.log(num[num.length - 1]); 