//1  შექმენით რიცხვების სია და ამ სიიდან გამოიტანეთ მაქსიმალური და მინიმალური მნიშვნელობები
console.log(Math.max(...[1,2,3,4,5]));
console.log(Math.min(...[1,2,3,4,5]));


//2 შემთხვევითობის პრინციპით 10'ის ფარგლებში გამოიტანეთ რიცხვი შემდეგ კი ამ რიცხვიდან გამოიტანეთ წერტილამდე მყოფი რიცხვი 
consol.log(Math.trunc(1.12004));


//3 აიღეთ ნებისმიერი უარყოფითი რიცხვი და გადაიყვანეთ დადებითში

consol.log(Math.abs(-5));

//4 შექმენით ცვლადი სადაც შეინახავთ ათწილად რიცხვს შემდეგ ეს რიცხვი დაამრგვალეთ ჯერ მაღლა შემდეგ კი დაბლა.
consol.log(Math.ceil(2.5))
consol.log(Math.floor(2.5))